RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_syspm.h
/*******************************************************************************
* Function Name: Cy_SysPm_CoreBuckSetMode
****************************************************************************//**
*
* Set the Core Buck Regulator mode
*
* \param mode
* Pick from \ref cy_en_syspm_core_buck_mode_t
*
* \note
* This API is available for CAT1B devices.
*
*******************************************************************************/
void Cy_SysPm_CoreBuckSetMode(cy_en_syspm_core_buck_mode_t mode);

/*******************************************************************************
* Function Name: Cy_SysPm_CoreBuckGetMode
****************************************************************************//**
*
* Get the Core Buck Regulator Mode
*
* \return
* Gets enum value of type \ref cy_en_syspm_core_buck_mode_t
*
* \note
* This API is available for CAT1B devices.
*
*******************************************************************************/
cy_en_syspm_core_buck_mode_t Cy_SysPm_CoreBuckGetMode(void);

/*******************************************************************************
* Function Name: Cy_SysPm_CoreBuckConfig
****************************************************************************//**
*
* Configures the Core Buck Regulator
*
* \param config
* Structure containing the config parameters, \ref cy_stc_syspm_core_buck_params_t
*
* \note
* This API is available for CAT1B devices.
*
* \return
* see \ref cy_en_syspm_status_t.
*
*******************************************************************************/
cy_en_syspm_status_t Cy_SysPm_CoreBuckConfig(cy_stc_syspm_core_buck_params_t *config);

/*******************************************************************************
* Function Name: Cy_SysPm_CoreBuckStatus
****************************************************************************//**
*
* Get the status of Core Buck Regulator
*
* \return
* Gets enum value of type \ref cy_en_syspm_status_t
*
* \note
* This API is available for CAT1B devices.
*
*******************************************************************************/
cy_en_syspm_status_t Cy_SysPm_CoreBuckStatus(void);

/*******************************************************************************
* Function Name: Cy_SysPm_LdoExtraRequester
****************************************************************************//**
*
* Configures the Extra Requester for Core Buck Regulator
*
* \param extraReqConfig
* Pointer to structure containing the extra requester config parameters,
* \ref cy_stc_syspm_extraReq_params_t
*
* \note
* This API is available for CAT1B devices.
*
* \return
* see \ref cy_en_syspm_status_t.
*
*******************************************************************************/
cy_en_syspm_status_t Cy_SysPm_LdoExtraRequester(cy_stc_syspm_extraReq_params_t *extraReqConfig);

#endif
/** \} group_syspm_functions_buck */


/**
* \addtogroup group_syspm_functions_ldo
* \{
*/
#if defined (CY_IP_MXS40SRSS)
/*******************************************************************************
* Function Name: Cy_SysPm_LdoGetVoltage
****************************************************************************//**
*
* Gets the current output voltage value of the core LDO regulator.
*
* \note The actual device Vccd voltage can be different from the
* nominal voltage because the actual voltage value depends on conditions
* including the load current.
*
* \return
* The nominal output voltage of the LDO. See \ref cy_en_syspm_ldo_voltage_t.
*
* \funcusage
* \snippet syspm/snippet/main.c snippet_Cy_SysPm_VoltageRegulator
*
* \note
* This API is available for CAT1A devices.
*
*******************************************************************************/
cy_en_syspm_ldo_voltage_t Cy_SysPm_LdoGetVoltage(void);
#endif

/*******************************************************************************
* Function Name: Cy_SysPm_LdoIsEnabled
****************************************************************************//**
*
* Reads the current status of the core LDO regulator.
*
* \return
* - True means the LDO is enabled.
* - False means it is disabled.
*
* \funcusage
* \snippet syspm/snippet/main.c snippet_Cy_SysPm_VoltageRegulator
*
*******************************************************************************/
bool Cy_SysPm_LdoIsEnabled(void);

#if defined (CY_IP_MXS40SSRSS) || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_SysPm_SdrConfigure
****************************************************************************//**
*
* Configures the SDR(Step Down Regulator)
*
* \param sdr
* CY_SYSPM_SDR_0 - for SDR0
* CY_SYSPM_SDR_1 - for SDR1
*
* \param config
* Structure containing the config parameters, \ref cy_stc_syspm_sdr_params_t
*
* \note
* This API is available for CAT1B devices.
*
*******************************************************************************/
void Cy_SysPm_SdrConfigure(cy_en_syspm_sdr_t sdr, cy_stc_syspm_sdr_params_t *config);

/*******************************************************************************
* Function Name: Cy_SysPm_SdrSetVoltage
****************************************************************************//**
*
* Set the SDR(Step Down Regulator) Voltage
*
* \param sdr
* CY_SYSPM_SDR_0 - for SDR0
* CY_SYSPM_SDR_1 - for SDR1
*
* \param voltage
* Pick from \ref cy_en_syspm_sdr_voltage_t
*

* \note
* This API is available for CAT1B devices.
*
*******************************************************************************/
void Cy_SysPm_SdrSetVoltage(cy_en_syspm_sdr_t sdr, cy_en_syspm_sdr_voltage_t voltage);


/*******************************************************************************
* Function Name: Cy_SysPm_SdrGetVoltage
****************************************************************************//**
*
* Get the SDR(Step Down Regulator) Voltage
*
* \param sdr
* CY_SYSPM_SDR_0 - for SDR0
* CY_SYSPM_SDR_1 - for SDR1
*
* \return
* Gets Voltage enum value of type \ref cy_en_syspm_sdr_t
*
* \note
* This API is available for CAT1B devices.
*
*******************************************************************************/
cy_en_syspm_sdr_voltage_t Cy_SysPm_SdrGetVoltage(cy_en_syspm_sdr_t sdr);

