RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_syspm.h
/*******************************************************************************
* Function Name: Cy_SysPm_SdrEnable
****************************************************************************//**
*
* Enable the SDR(Step Down Regulator)
*
* \param sdr
* CY_SYSPM_SDR_0 - for SDR0
* CY_SYSPM_SDR_1 - for SDR1
*
* \param enable
* true - enable, false - disable
*
* \note
* This parameter is available for CAT1B devices.
*
*******************************************************************************/
void Cy_SysPm_SdrEnable(cy_en_syspm_sdr_t sdr, bool enable);

/*******************************************************************************
* Function Name: Cy_SysPm_IsSdrEnabled
****************************************************************************//**
*
* Checks if SDR(Step Down Regulator) is enabled or not.
*
* \param sdr
* CY_SYSPM_SDR_0 - for SDR0
* CY_SYSPM_SDR_1 - for SDR1
*
* \return
* True if enabled, False if disabled.
*
* \note
* This parameter is available for CAT1B devices.
*
*******************************************************************************/
bool Cy_SysPm_IsSdrEnabled(cy_en_syspm_sdr_t sdr);

/*******************************************************************************
* Function Name: Cy_SysPm_HvLdoConfigure
****************************************************************************//**
*
* Configures the HVLDO Regulator
*
* \param config
* Structure containing the config parameters, \ref cy_stc_syspm_hvldo_params_t
*
* \note
* This parameter is available for CAT1B devices.
*
*******************************************************************************/
void Cy_SysPm_HvLdoConfigure(cy_stc_syspm_hvldo_params_t *config);

/*******************************************************************************
* Function Name: Cy_SysPm_HvLdoSetVoltage
****************************************************************************//**
*
* Set the HVLDO Regulator Voltage
*
* \param voltage
* Pick from \ref cy_en_syspm_hvldo_voltage_t
*
* \note
* This parameter is available for CAT1B devices.
*
*******************************************************************************/
void Cy_SysPm_HvLdoSetVoltage(cy_en_syspm_hvldo_voltage_t voltage);

/*******************************************************************************
* Function Name: Cy_SysPm_HvLdoGetVoltage
****************************************************************************//**
*
* Get the HVLDO Regulator Voltage
*
* \return
* Gets Voltage enum value of type \ref cy_en_syspm_hvldo_voltage_t
*
* \note
* This parameter is available for CAT1B devices.
*
*******************************************************************************/
cy_en_syspm_hvldo_voltage_t Cy_SysPm_HvLdoGetVoltage(void);

/*******************************************************************************
* Function Name: Cy_SysPm_HvLdoEnable
****************************************************************************//**
*
* Enable the HVLDO Regulator
*
* \param enable
* true - enable, false - disable
*
* \note
* This parameter is available for CAT1B devices.
*
*******************************************************************************/
void Cy_SysPm_HvLdoEnable(bool enable);

/*******************************************************************************
* Function Name: Cy_SysPm_IsHvLdoEnabled
****************************************************************************//**
*
* Checks if HVLDO Regulator is enabled or not.
*
* \return
* True if enabled, False if disabled.
*
* \note
* This parameter is available for CAT1B devices.
*
*******************************************************************************/
bool Cy_SysPm_IsHvLdoEnabled(void);

#endif
/** \} group_syspm_functions_ldo */


/**
* \addtogroup group_syspm_functions_iofreeze
* \{
*/
/*******************************************************************************
* Function Name: Cy_SysPm_IoIsFrozen
****************************************************************************//**
*
* Checks whether IOs are frozen.
*
* \return
* - True if IOs are frozen.
* - False if IOs are unfrozen.
*
* \funcusage
* \snippet syspm/snippet/main.c snippet_Cy_SysPm_IoUnfreeze
*
*******************************************************************************/
bool Cy_SysPm_IoIsFrozen(void);

/*******************************************************************************
* Function Name: Cy_SysPm_IoUnfreeze
****************************************************************************//**
*
* This function unfreezes the I/O cells that are automatically frozen when
* Hibernate is entered with the call to \ref Cy_SysPm_SystemEnterHibernate().
*
* I/O cells remain frozen after a wakeup from Hibernate mode until the
* firmware unfreezes them by calling this function.
*
* If the firmware must retain the data value on the pin, then the
* value must be read and re-written to the pin's port data register before
* calling this function. Furthermore, the drive mode must be re-programmed
* before the pins are unfrozen. If this is not done, the pin will change to
* the default state the moment the freeze is removed.
*
* Note that I/O cell configuration can be changed while frozen. The new
* configuration becomes effective only after the pins are unfrozen.
*
* \funcusage
* \snippet syspm/snippet/main.c snippet_Cy_SysPm_IoUnfreeze
*
*******************************************************************************/
void Cy_SysPm_IoUnfreeze(void);

#if defined (CY_IP_MXS40SSRSS) || defined (CY_DOXYGEN)

/*******************************************************************************
* Function Name: Cy_SysPm_DeepSleepIoIsFrozen
****************************************************************************//**
*
* Checks whether IOs are frozen during DEEPSLEEP-RAM/OFF
*
* \return
* - True if IOs are frozen.
* - False if IOs are unfrozen.
*
*******************************************************************************/
bool Cy_SysPm_DeepSleepIoIsFrozen(void);

/*******************************************************************************
* Function Name: Cy_SysPm_DeepSleepIoUnfreeze
****************************************************************************//**
*
* This function unfreezes the I/O cells that are automatically frozen when
* DEEPSLEEP-RAM/OFF is entered.
*
* I/O cells remain frozen after a wakeup from DEEPSLEEP_RAM/OFF mode until the
* firmware unfreezes them by calling this function.
*
* If the firmware must retain the data value on the pin, then the
* value must be read and re-written to the pin's port data register before
* calling this function. Furthermore, the drive mode must be re-programmed
* before the pins are unfrozen. If this is not done, the pin will change to
* the default state the moment the freeze is removed.
*
* Note that I/O cell configuration can be changed while frozen. The new
* configuration becomes effective only after the pins are unfrozen.
*
*******************************************************************************/
void Cy_SysPm_DeepSleepIoUnfreeze(void);

#endif

/** \} group_syspm_functions_iofreeze */



/**
* \addtogroup group_syspm_functions_pmic
* \{
*/

#if defined (CY_IP_MXS40SRSS)

